#输入的4个数用空格分隔，可以用以下方法表达
#a=list(map(float,x.split()))
#1 2 3 分别为年 月 日
x = input()
s1 = 0
s2 = 0
s3 = 0
a=list(map(float,x.split()))
if(a[2]==1):
    s1 = (a[3]/a[0])/a[1]*1
    print('在投资金额为:{:.1f},投资时长为{:.1f},收益为:{:.1f}的情况下,年化收益率为:{:.3f}'.format(a[0],a[1],a[3],s1))
if(a[2]==2):
    s2 = (a[3]/a[0])/a[1]*12
    print('在投资金额为:{:.1f},投资时长为{:.1f},收益为:{:.1f}的情况下,年化收益率为:{:.3f}'.format(a[0],a[1],a[3],s2))
if(a[2]==3):
    s3 = (a[3]/a[0])/a[1]*365
    print('在投资金额为:{:.1f},投资时长为{:.1f},收益为:{:.1f}的情况下,年化收益率为:{:.3f}'.format(a[0],a[1],a[3],s3))

